       ID DIVISION.
       PROGRAM-ID. ACCEPT01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM-1 PIC 99.
       PROCEDURE DIVISION.
       ACCEPT ITEM-1.
       DISPLAY "ITEM-1:" ITEM-1.
