       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCEPT13.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 DISP-MSG PIC 9(10).
       01 ITEM-1   PIC 99.
       PROCEDURE DIVISION.
       ACCEPT DISP-MSG FROM CONSOLE.
       DISPLAY 'MSG = ' DISP-MSG.
       ACCEPT ITEM-1 FROM CONSOLE.
       DISPLAY "ITEM-1:" ITEM-1.
