       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCEPT03.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ALPNMR PIC 9(10).
      * 01 NUM    usage comp-2.
       PROCEDURE DIVISION.
      * ACCEPT ALPNMR FROM DATE.
      * DISPLAY 'MSG = ' ALPNMR.
      * ACCEPT ALPNMR FROM DATE .
      * DISPLAY 'MSG = ' ALPNMR.
      * ACCEPT ALPNMR FROM DAY YYYYDDD .
      * DISPLAY 'MSG = ' ALPNMR.
       ACCEPT ALPNMR FROM DAY .
       DISPLAY 'MSG = ' ALPNMR.
      * ACCEPT ALPNMR FROM DAY-OF-WEEK .
      * DISPLAY 'MSG = ' ALPNMR.
      * ACCEPT ALPNMR FROM TIME .
      * DISPLAY 'MSG = ' ALPNMR.
      * DISPLAY "NUMERIC"
      * ACCEPT NUM FROM DATE YYYYMMDD.
      * DISPLAY 'MSG = ' NUM.
      * ACCEPT NUM FROM DATE .
      * DISPLAY 'MSG = ' NUM.
      * ACCEPT NUM FROM DAY YYYYDDD .
      * DISPLAY 'MSG = ' NUM.
      * ACCEPT NUM FROM DAY .
      * DISPLAY 'MSG = ' NUM.
      * ACCEPT NUM FROM DAY-OF-WEEK .
      * DISPLAY 'MSG = ' NUM.
      * ACCEPT NUM FROM TIME .
      * DISPLAY 'MSG = ' NUM.
