       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCEPT01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 DISP-MSG PIC X(20).
       PROCEDURE DIVISION.
       ACCEPT DISP-MSG.
       DISPLAY 'MSG = ' DISP-MSG.
