       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM-01 PIC 9999.
       01 ITEM-02 PIC 9999.
       PROCEDURE DIVISION.
       MOVE 4321 TO ITEM-02.
       ADD 1234 TO ITEM-02 GIVING ITEM-01 
       ON SIZE ERROR DISPLAY "NO:"ITEM-01
       NOT ON SIZE ERROR DISPLAY "OK:"ITEM-01
