       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITH.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM1 PIC 9(9).
       PROCEDURE DIVISION.
       COMPUTE ITEM1 = 122 - 1.1.

       DISPLAY ITEM1.
