       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COMPUTE14.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC 9(18) COMP-5.
       01 C PIC 9(18) COMP-5.
       01 E PIC 9(18) COMP-5.
       01 B PIC 9(18).

       PROCEDURE DIVISION.

       DISPLAY "== ARITH09: UNSIGNED LONG LONG  ==".
       COMPUTE A = 11999999999999999988.
       COMPUTE A = A / 12.

       IF A = 999999999999999999 THEN
        DISPLAY "SUCCESS : " A
       ELSE
        DISPLAY "FAIL : " A
       END-IF.

