       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITH07.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM1 PIC 9(9).
       01 ITEM2 PIC 9(9).
       PROCEDURE DIVISION.
       COMPUTE ITEM1 = ( 8 / 3 ) * 3.
       DISPLAY ITEM1.
       COMPUTE ITEM2 = ( 2 * 1.2 ) / 1.2.
       DISPLAY ITEM2.
