       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COMPUTE19.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC 9(18) COMP-5.
       01 B PIC 9(18).

       PROCEDURE DIVISION.

       DISPLAY "== ARITH08: UNSIGNED LONG LONG  ==".
       COMPUTE A = 999999999999999999
       COMPUTE A = A * 12
       COMPUTE B = A / -1

       IF B = 446744073709551628 THEN
        DISPLAY "SUCCESS : " B
       ELSE
        DISPLAY "FAIL : " B
       END-IF.
