       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITH.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM1 PIC 9(4).
       PROCEDURE DIVISION.
       COMPUTE ITEM1 = +1234.

       DISPLAY ITEM1.
