       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITH.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM1 PIC S9(9) VALUE 1234.
       PROCEDURE DIVISION.
       COMPUTE ITEM1 = -ITEM1.

       DISPLAY ITEM1.
