       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLBYVALUE.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VA-RECORD.
          03 VA PIC 9(4) OCCURS 2 TIMES.
       01 VB PIC 9(4).

       PROCEDURE DIVISION.
       MOVE 11112222 TO VA-RECORD.
       MOVE 4444 TO VB.
       CALL "ADD_TWO" USING REFERENCE VA-RECORD VB.
       DISPLAY "A(1): "VA(1).
       DISPLAY "A(2): "VA(2).
       DISPLAY "B   : "VB.
       EXIT PROGRAM.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD_TWO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 PARM-RECORD.
          03 PARM_A PIC 9(4) OCCURS 2 TIMES.
       01 PARM_B PIC 9(4). 

       PROCEDURE DIVISION USING REFERENCE PARM-RECORD PARM_B.
       DISPLAY "A(1): "PARM_A(1).
       DISPLAY "A(2): "PARM_A(2).
       DISPLAY "B   : "PARM_B.
       ADD PARM_A(1) TO PARM_A(2) GIVING PARM_B.
       DISPLAY "CALLEE END".
       EXIT PROGRAM.
       END PROGRAM ADD_TWO.
