       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLBYVALUE.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VA-RECORD.
          03 VA PIC 9(4) USAGE DISPLAY.
          03 VB PIC 9(4) USAGE DISPLAY.
          03 VC PIC 9(4) USAGE DISPLAY.

       PROCEDURE DIVISION.
       MOVE 1111 TO VA.
       MOVE 2222 TO VB.
       MOVE 0 TO VC.
       CALL "ADD_TWO" USING BY REFERENCE VA-RECORD.
       DISPLAY "A:"VA.
       DISPLAY "B:"VB.
       DISPLAY "C:"VC.
       EXIT PROGRAM.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD_TWO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 PARM-RECORD.
          03 PARM_A PIC 9(4) USAGE DISPLAY.
          03 PARM_B PIC 9(4) USAGE DISPLAY.
          03 PARM_C PIC 9(4) USAGE DISPLAY.

       PROCEDURE DIVISION USING BY REFERENCE PARM-RECORD.
       DISPLAY "A:"PARM_A.
       DISPLAY "B:"PARM_B.
       DISPLAY "C:"PARM_C.
       ADD PARM_A TO PARM_B GIVING PARM_C.
       DISPLAY "CALLEE END".
       EXIT PROGRAM.
       END PROGRAM ADD_TWO.
