       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLBYVALUE.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VA USAGE COMP-1.
       01 VB USAGE COMP-1.

       PROCEDURE DIVISION.
       MOVE 111 TO VA.
       MOVE 222 TO VB.
       CALL "ADD_TWO" USING BY REFERENCE VA VB.
       DISPLAY "A:"VA.
       DISPLAY "B:"VB.
       EXIT PROGRAM.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD_TWO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 PARM_A USAGE COMP-1. 
       01 PARM_B USAGE COMP-1.

       PROCEDURE DIVISION USING BY REFERENCE PARM_A PARM_B. 
       DISPLAY "A:"PARM_A.
       DISPLAY "B:"PARM_B.

       ADD PARM_A TO PARM_B.

       DISPLAY "CALLEE END".
       EXIT PROGRAM.
       END PROGRAM ADD_TWO.
