       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLBYVALUE.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VA PIC 9(4) USAGE DISPLAY.
       01 VB PIC 9(4) USAGE DISPLAY.
       01 VC PIC 9(4) USAGE DISPLAY.
       01 FUNC_NAME PIC X(20).

       PROCEDURE DIVISION.
       MOVE 1111 TO VA.
       MOVE 2222 TO VB.
       MOVE 0 TO VC.
       CALL "ADD_TWO" USING BY CONTENT LENGTH OF VA 
       BY CONTENT LENGTH OF VB .
       DISPLAY "A:"VA.
       DISPLAY "B:"VB.
       EXIT PROGRAM.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD_TWO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 PARM_A PIC 9(9) USAGE COMP.
       01 PARM_B PIC 9(9) USAGE COMP.
       01 PARM_C PIC 9(4) USAGE DISPLAY.

       PROCEDURE DIVISION USING PARM_A PARM_B.
       DISPLAY "PARM A:"PARM_A.
       DISPLAY "PARM B:"PARM_B.
       DISPLAY "CALLEE END".
       EXIT PROGRAM.
       END PROGRAM ADD_TWO.
