       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLBYVALUE.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VA PIC 9(4) USAGE DISPLAY.
       01 VB PIC 9(4) USAGE DISPLAY.
       01 VC PIC 9(4) USAGE DISPLAY.
       01 FUNC_NAME PIC X(20).

       PROCEDURE DIVISION.
       CALL "ADD_TWO".
       CANCEL "ADD_TWO".
       CALL "ADD_TWO".
       EXIT PROGRAM.
       END PROGRAM CALLBYVALUE.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD_TWO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PARM_A PIC 9(4) VALUE 1.
       PROCEDURE DIVISION.
       DISPLAY "A:"PARM_A.
       COMPUTE PARM_A = 1 + PARM_A.
       DISPLAY "A:"PARM_A.
       EXIT PROGRAM.
       END PROGRAM ADD_TWO.
