       ID DIVISION.
       PROGRAM-ID. I97265.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FILE-ST PIC X.
       01 FILE-ST2 PIC X.
       PROCEDURE DIVISION.
       MOVE "0" TO FILE-ST.
       MOVE "A" TO FILE-ST2.

       DISPLAY FILE-ST UPON HEXA.
       DISPLAY FILE-ST2 UPON HEXA.
       IF FILE-ST2 > FILE-ST
         DISPLAY "OK".

