       IDENTIFICATION DIVISION.
       PROGRAM-ID.    CURRENC1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           CURRENCY SIGN IS "$" WITH PICTURE SYMBOL "F".

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 V11 PIC FFFF99999.
       01 V12 PIC FFFFZZZZZ.

       PROCEDURE DIVISION.
       MOVE 1234 TO V11.
       DISPLAY V11.
       MOVE 0012 TO V12.
       DISPLAY V12.

       STOP RUN.
