       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVIDE01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM-01 PIC 9999.
       01 ITEM-02 PIC 9999.
       PROCEDURE DIVISION.
       MOVE 5 TO ITEM-01.
       MOVE 5555 TO ITEM-02.
       DIVIDE ITEM-01 INTO ITEM-02 
       ON SIZE ERROR DISPLAY "NO:"ITEM-02
       NOT ON SIZE ERROR DISPLAY "OK:"ITEM-02.
