       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVIDE21.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I-RECORD.
          03   I-CODE1   PIC   9(05).
          03   I-CODE2   PIC  S9(05).
       01 I-ITEM01       PIC  S9(05) VALUE 55555.

       PROCEDURE DIVISION.

       DIVIDE  10 INTO I-ITEM01 GIVING I-CODE1 ROUNDED.
       DISPLAY I-CODE1.

       DIVIDE  I-ITEM01 BY 10 GIVING I-CODE1 ROUNDED.
       DISPLAY I-CODE1.
