       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVIDE01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GR1.
        02 ITEM-01 PIC 999V9.
       01 GR2.
        02 ITEM-02 PIC 999V9.
       01 ITEM-03 PIC 999V9.
       01 ITEM-04 PIC 999V9.
       PROCEDURE DIVISION.
       MOVE 5 TO ITEM-01.
       MOVE 555.9 TO ITEM-02.
       DIVIDE ITEM-01 INTO ITEM-02 GIVING ITEM-03 REMAINDER ITEM-04.
       DISPLAY ITEM-03.
       DISPLAY ITEM-04.
