       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVIDE01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM-01 PIC 999V9. 
       01 ITEM-02 PIC 999.
       PROCEDURE DIVISION.
       MOVE 555 TO ITEM-02.
       DIVIDE 5 BY ITEM-02 GIVING ITEM-01 ROUNDED.
       DISPLAY ITEM-01.
