       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVIDE13.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A-REC.
          03 A-CODE1    PIC 9(25).
       01 B-REC REDEFINES A-REC.
          03 B-CODE1    PIC 9(05) OCCURS 3 TIMES.
          03 B-CODE2    PIC 9(05).
          03 B-CODE3    PIC 9(05).

       PROCEDURE DIVISION.
       MOVE 1000020000300004000050000 TO A-CODE1.
       DISPLAY 'B-CODE1(1) : 'B-CODE1(1).
       DISPLAY 'B-CODE1(2) : 'B-CODE1(2).
       DISPLAY 'B-CODE1(3) : 'B-CODE1(3).
       DISPLAY 'B-CODE2    : 'B-CODE2.
       DISPLAY 'B-CODE3    : 'B-CODE3.

       DIVIDE B-CODE1(1) INTO B-CODE1(2) GIVING B-CODE3.
       DISPLAY 'B-CODE1(2)/B-CODE1(1) : 'B-CODE3.
