       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVIDE01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM-02 PIC S999V9.
       01 ITEM-01 PIC 99 comp.
       PROCEDURE DIVISION.
       MOVE 5 TO ITEM-01.
       MOVE 555.2 TO ITEM-02.
       DIVIDE 5 INTO ITEM-02 ROUNDED.  
       DISPLAY ITEM-02.
