       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVIDE01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GR1.
        02 ITEM-01 PIC 9999.
       01 GR2.
        02 ITEM-02 PIC 9999.
       PROCEDURE DIVISION.
       MOVE 5 TO ITEM-01.
       MOVE 5555.9 TO ITEM-02.
       DIVIDE ITEM-01 INTO ITEM-02.
       DISPLAY ITEM-02.
