       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVIDE01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A-REC.
          03 A-CODE1    PIC 9(15).
       01 B-REC REDEFINES A-REC.
          03 B-CODE1    PIC 9(05). 
          03 B-CODE2    PIC 9(05).
          03 B-CODE3    PIC 9(05).

       PROCEDURE DIVISION.
       MOVE 100002000030000 TO A-CODE1.

       DISPLAY 'B-CODE1 : 'B-CODE1.
       DISPLAY 'B-CODE2 : 'B-CODE2.
       DISPLAY 'B-CODE3 : 'B-CODE3.

       DIVIDE B-CODE1  INTO B-CODE3.
       DISPLAY 'B-CODE3/B-CODE1 : 'B-CODE3.
