       IDENTIFICATION DIVISION.
       PROGRAM-ID.    COMPUTE14.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC 9(18) COMP-5.
       01 C PIC 9(18) COMP-5.
       01 E PIC 9(18) COMP-5.
       01 B PIC 9(18).

       PROCEDURE DIVISION.

       DISPLAY "== COMPUTE: UNSIGNED LONG LONG  ==".
       COMPUTE A = 999999999999999999
       DISPLAY "A =" A
       COMPUTE A = A * 12
       DISPLAY " A*12 = " A
       COMPUTE A = A / 12

       COMPUTE C=1111111111111111111
       COMPUTE C=C*11
       DISPLAY C

       IF A = 999999999999999999 THEN
        DISPLAY "SUCCESS : " A
       ELSE
        DISPLAY "FAIL : " A
       END-IF.

       COMPUTE B = 999999999999999999
       COMPUTE A = B * 12
       COMPUTE B = A / 12

       IF B = 999999999999999999 THEN
        DISPLAY "SUCCESS : " B
       ELSE
        DISPLAY "FAIL : " B
       END-IF.
