       IDENTIFICATION DIVISION.
       PROGRAM-ID. entry1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 vc PIC s9(8) USAGE COMP-5.

       PROCEDURE DIVISION.
       DISPLAY "== FUNCTION ENTRY RETURN TEST =="
       CALL "FUNC1".
       CALL "ENTRY0001".
       DISPLAY "SUCCESS".
       EXIT PROGRAM.
       END PROGRAM "entry1".

       IDENTIFICATION DIVISION.
       PROGRAM-ID. FUNC1.

       PROCEDURE DIVISION.
       DISPLAY "FUNCT1"
       EXIT PROGRAM.
       ENTRY "ENTRY0001".
       DISPLAY "ENTRY0001".
       END PROGRAM "FUNC1".
