       IDENTIFICATION DIVISION.
       PROGRAM-ID. eval2.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COND_VAR PIC 9(2) USAGE COMP-5.
       01 RESULT_VAR PIC 9(1) USAGE COMP-5.

       PROCEDURE DIVISION.
       BEGIN.
       MOVE 13 TO COND_VAR.
    
       EVALUATE COND_VAR 
       WHEN  1 THRU  5 MOVE 1 TO RESULT_VAR
       WHEN  6 THRU 10 MOVE 2 TO RESULT_VAR
       WHEN 11 THRU 15 MOVE 3 TO RESULT_VAR
       WHEN 16 THRU 20 MOVE 4 TO RESULT_VAR
       END-EVALUATE.
       
       DISPLAY "EVAL2:" RESULT_VAR.

       GOBACK.

