       IDENTIFICATION DIVISION.
       PROGRAM-ID. eval3.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESULT_VAR PIC 9(1) USAGE COMP-5.

       PROCEDURE DIVISION.
       BEGIN.
    
       EVALUATE  TRUE ALSO FALSE  
       WHEN TRUE  ALSO TRUE  MOVE 1 TO RESULT_VAR
       WHEN TRUE  ALSO FALSE MOVE 2 TO RESULT_VAR
       WHEN FALSE ALSO FALSE MOVE 3 TO RESULT_VAR
       WHEN FALSE ALSO TRUE  MOVE 4 TO RESULT_VAR
       END-EVALUATE.
       
       DISPLAY "EVAL3:" RESULT_VAR.

       GOBACK.

