       IDENTIFICATION DIVISION.
       PROGRAM-ID. eval4.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COND_VAR PIC 9(1) USAGE COMP-5.
       01 RESULT_VAR PIC 9(1) USAGE COMP-5.

       PROCEDURE DIVISION.
       BEGIN.
       MOVE 5 TO COND_VAR.
    
       EVALUATE COND_VAR 
       WHEN 1 MOVE 3 TO RESULT_VAR
       WHEN 2 MOVE 4 TO RESULT_VAR
       WHEN 3 MOVE 5 TO RESULT_VAR
       WHEN 4 MOVE 6 TO RESULT_VAR
       WHEN OTHER MOVE 7 TO RESULT_VAR
       END-EVALUATE.
       
       DISPLAY "EVAL4:" RESULT_VAR.
       GOBACK.

