       IDENTIFICATION DIVISION.
       PROGRAM-ID. eval5.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COND_VAR PIC 9(2).
       01 COND_VAR2 PIC 9(2).
       01 RESULT_VAR PIC 9(1) USAGE COMP-5.

       PROCEDURE DIVISION.
       BEGIN.

       MOVE 10 TO COND_VAR.
       MOVE 13 TO COND_VAR2.
    
       EVALUATE  COND_VAR ALSO COND_VAR2 
       WHEN 11 ALSO 11 MOVE 1 TO RESULT_VAR
       WHEN 10 ALSO 11 MOVE 2 TO RESULT_VAR
       WHEN 10 ALSO 13 MOVE 3 TO RESULT_VAR
       WHEN 11 ALSO 13 MOVE 4 TO RESULT_VAR
       END-EVALUATE.
       
       DISPLAY "EVAL5:" RESULT_VAR.

       GOBACK.

