       IDENTIFICATION DIVISION.
       PROGRAM-ID. evaluate07.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COND_VAR1 PIC 9(2) USAGE COMP-5.
       01 COND_VAR2 PIC 9(2) USAGE COMP-5.
       01 RESULT_VAR PIC 9(1) USAGE COMP-5.

       PROCEDURE DIVISION.
       BEGIN.

       MOVE 13 TO COND_VAR1.
       MOVE  3 TO COND_VAR2.
    
       EVALUATE  COND_VAR1 ALSO TRUE  
       WHEN  1 THRU 10 ALSO COND_VAR2 < 10 MOVE 1 TO RESULT_VAR
       WHEN 11 THRU 20 ALSO COND_VAR2 > 10 MOVE 2 TO RESULT_VAR
       WHEN  1 THRU 10 ALSO COND_VAR2 > 20 MOVE 3 TO RESULT_VAR
       WHEN 11 THRU 20 ALSO COND_VAR2 < 20 MOVE 4 TO RESULT_VAR
       END-EVALUATE.
       
       DISPLAY "EVAL07:" RESULT_VAR.

       GOBACK.

