       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXIT01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       CALL "A001".

       IDENTIFICATION DIVISION.
       PROGRAM-ID. A001.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
         DISPLAY "A01".
         EXIT.
         DISPLAY "ERROR A01-EXIT".
       END PROGRAM A001.
