       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXIT01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
         DISPLAY "EXIT STATEMENT".
         EXIT PROGRAM.
         DISPLAY "ERROR EXIT".
