       IDENTIFICATION DIVISION.
       PROGRAM-ID. exit_program.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COND_VAR PIC 9(2) USAGE COMP-5.

       PROCEDURE DIVISION.
       DISPLAY "EXIT PROGRAM".
       EXIT PROGRAM.
       DISPLAY "ERROR".

