       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXIT03_2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COND_VAR PIC 9(2) USAGE COMP-5.
       01 VA PIC 9(4) VALUE 1111.
       01 VB PIC 9(4) VALUE 2222.
       01 VC PIC 9(4) VALUE 0.

       PROCEDURE DIVISION.
       DISPLAY "EXIT PROGRAM CALL".
       CALL "EXITSUB" USING BY REFERENCE VA VB VC.
      * CALL "EXITSUB" USING BY REFERENCE VA VB RETURNING VC.
       DISPLAY "VC : " VC.
       EXIT PROGRAM.
       DISPLAY "ERROR MAIN PROGRAM".
       END PROGRAM "EXIT01".



       IDENTIFICATION DIVISION.
       PROGRAM-ID.  EXITSUB.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESULT PIC 9(4).

       LINKAGE SECTION.
       01 PARM-A PIC 9(4).
       01 PARM-B PIC 9(4).
       01 PARM-C PIC 9(4).

       PROCEDURE DIVISION USING BY REFERENCE PARM-A PARM-B PARM-C.
      * PROCEDURE DIVISION USING BY REFERENCE PARM-A PARM-B
      *           RETURNING PARM-C.
       ADD PARM-A TO PARM-B GIVING PARM-C.
      * EXIT PROGRAM RETURNING RESULT.
       DISPLAY "EXIT SUB PROGRAM".
       EXIT PROGRAM. 
       DISPLAY "ERROR SUB PROGRAM".
       END PROGRAM "EXITSUB".
