       IDENTIFICATION DIVISION.
       PROGRAM-ID. GOBACK01_2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       CALL "A001".

       IDENTIFICATION DIVISION.
       PROGRAM-ID. A001.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
         DISPLAY "GOBACK SUB PROGRAM".
         GOBACK.
         DISPLAY "ERROR SUB PROGRAM".
       END PROGRAM A001.
