       IDENTIFICATION DIVISION.
       PROGRAM-ID. GOBACK01.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY "START GOBACK".
       GOBACK.
       DISPLAY "ERROR".
