       IDENTIFICATION DIVISION.
       PROGRAM-ID. init1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-6 PIC 999 USAGE COMP-3. 

       PROCEDURE DIVISION.
       MOVE 123 TO VAR-6.
       DISPLAY "PACKEDEC[" VAR-6 "]"
       INITIALIZE VAR-6
       DISPLAY "PACKEDEC[" VAR-6 "]"
