       IDENTIFICATION DIVISION.
       PROGRAM-ID. init3.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-RECORD.
          05 FLD-1 PIC 999.
          05 FLD-2 PIC XXXXX.
          05 FLD-3 PIC 99.


       PROCEDURE DIVISION.
       MOVE 777 TO FLD-1.
       MOVE "ZZZZZ" TO FLD-2.
       MOVE 888 TO FLD-3.
       DISPLAY "GROUP[" VAR-RECORD "]"
       INITIALIZE VAR-RECORD
       DISPLAY "GROUP[" VAR-RECORD "]"

