       IDENTIFICATION DIVISION.
       PROGRAM-ID. init1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-3 PIC 999 USAGE COMP.

       PROCEDURE DIVISION.
       MOVE 123 TO VAR-3.
       DISPLAY "BINARY[" VAR-3 "]"
       INITIALIZE VAR-3
       DISPLAY "BINARY[" VAR-3 "]"

