       IDENTIFICATION DIVISION.
       PROGRAM-ID. init1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-1 PIC XXX.

       PROCEDURE DIVISION.
       MOVE "ABC" TO VAR-1.
       DISPLAY "ALPHNUM[" VAR-1 "]"
       INITIALIZE VAR-1
       DISPLAY "ALPHNUM[" VAR-1 "]"

