       IDENTIFICATION DIVISION.
       PROGRAM-ID. initialize01_4.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-4 USAGE COMP-1.
       PROCEDURE DIVISION.
       MOVE 123 TO VAR-4.
       DISPLAY "FLOAT[" VAR-4 "]"
       INITIALIZE VAR-4
       DISPLAY "FLOAT[" VAR-4 "]"

