       IDENTIFICATION DIVISION.
       PROGRAM-ID. init1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-5 USAGE COMP-2.

       PROCEDURE DIVISION.
       MOVE 123 TO VAR-5.
       DISPLAY "DOUBLE[" VAR-5 "]"
       INITIALIZE VAR-5
       DISPLAY "DOUBLE[" VAR-5 "]"

