       IDENTIFICATION DIVISION.
       PROGRAM-ID. init2.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-1 PIC XXX VALUE 'XXX'.

       PROCEDURE DIVISION.
       MOVE "DDD" TO VAR-1.
       DISPLAY "ALPH[" VAR-1 "]"
       INITIALIZE VAR-1
       REPLACING NUMERIC DATA BY 123
                 ALPHANUMERIC DATA BY "ABCDF".
       DISPLAY "ALPH[" VAR-1 "]"

