       IDENTIFICATION DIVISION.
       PROGRAM-ID. unstring1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SRC    PIC X(40).
       01 RESULT1 PIC X(10).
       01 DELIMA PIC X.
       01 DELIMB PIC X.
       01 DELIMC PIC X.
       01 CNT PIC 99.

       PROCEDURE DIVISION.
       MOVE "00ACADEMY00" TO SRC.
       MOVE 0 TO CNT.
       MOVE "0" TO DELIMA.
       MOVE "A" TO DELIMB.
       MOVE "Z" TO DELIMC.

       INSPECT SRC TALLYING CNT FOR CHARACTERS BEFORE DELIMA
       REPLACING ALL DELIMB BY DELIMC.

       DISPLAY "USTRING:" SRC.
       DISPLAY "C N T  :" CNT.
       DISPLAY "DELIMA :" DELIMA. 
       DISPLAY "DELIMB :" DELIMB. 

