       IDENTIFICATION DIVISION.
       PROGRAM-ID. move_test.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR-1 PIC X(11) VALUE "11111111111".
       01 A PIC 99 VALUE 9.
       PROCEDURE DIVISION.
       DISPLAY "MOVE 39 [" VAR-1 "]".
       MOVE ZERO TO VAR-1(2:A).
       DISPLAY "MOVE 39 [" VAR-1 "]".
