       IDENTIFICATION DIVISION.
       PROGRAM-ID.    MOVE037.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  GRP-AE-0002.
           05  AE-0002  PICTURE XX0XXBXXX.
       01  HIGH-VALUE-EDIT.
           02  HIGH-1   PICTURE XX  VALUE HIGH-VALUE.
           02  FILLER   PICTURE 9   VALUE 0.
           02  HIGH-2   PICTURE XX  VALUE HIGH-VALUE.
           02  FILLER   PICTURE X   VALUE SPACE.
           02  HIGH-3   PICTURE XXX VALUE HIGH-VALUE.

       PROCEDURE DIVISION.

      * MOVE HIGH-VALUE TO HIGH-1 HIGH-2 HIGH-3.
           MOVE HIGH-VALUE TO AE-0002.
           IF GRP-AE-0002 EQUAL TO HIGH-VALUE-EDIT
                DISPLAY "SUCCESS" 
           ELSE
                DISPLAY "FAIL" 
                DISPLAY "GRP-AE-0002     :" GRP-AE-0002
                DISPLAY "HIGH-VALUE-EDIT :" HIGH-VALUE-EDIT.

           MOVE LOW-VALUE TO HIGH-1 HIGH-2 HIGH-3.
           MOVE LOW-VALUE TO AE-0002.
           IF GRP-AE-0002 EQUAL TO HIGH-VALUE-EDIT
                DISPLAY "SUCCESS" 
           ELSE
                DISPLAY "FAIL" 
                DISPLAY "GRP-AE-0002     " GRP-AE-0002
                DISPLAY "HIGH-VALUE-EDIT " HIGH-VALUE-EDIT.
