       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLY01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM-01 PIC 999V9.
       01 ITEM-02 PIC 999V9.
       PROCEDURE DIVISION.
       MOVE 35 TO ITEM-02.
       MULTIPLY 3.5 BY ITEM-02 GIVING ITEM-01 ROUNDED.
       DISPLAY ITEM-01.
