       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLY01_3.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A-REC.
          03 A-CODE1    PIC 9(08).
       01 B-REC REDEFINES A-REC.
          03 B-CODE1    PIC 9(04).
          03 B-CODE2    PIC 9(04).

       PROCEDURE DIVISION.
       MOVE     00350030 TO A-CODE1. 
       MULTIPLY B-CODE1  BY B-CODE2.
       DISPLAY  B-CODE2.
