       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLY04_3.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A-REC.
          03 A-CODE1    PIC 9(12).
       01 B-REC REDEFINES A-REC.
          03 B-CODE1    PIC 9(04).
          03 B-CODE2    PIC 9(04).
          03 B-CODE3    PIC 9(04).

       PROCEDURE DIVISION.
       MOVE 003500300040 TO A-CODE1. 
       MULTIPLY B-CODE1  BY B-CODE2 GIVING B-CODE3.
       DISPLAY  B-CODE3.
