       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLY01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM-01 PIC 9999.
       01 ITEM-02 PIC 9999.
       PROCEDURE DIVISION.
       MOVE 35 TO ITEM-02.
       MULTIPLY 35 BY ITEM-02 GIVING ITEM-01.
       DISPLAY ITEM-01.
