       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLY01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM-02 PIC 999V9.
       PROCEDURE DIVISION.
       MOVE 35 TO ITEM-02.
       MULTIPLY 3.51 BY ITEM-02 ROUNDED.  
       DISPLAY ITEM-02.
