       ID DIVISION.
       PROGRAM-ID. perform4bs.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 IND_VAR PIC 9(2) USAGE COMP-5.
       01 TMP_VAR PIC 9(2) USAGE COMP-5.

       PROCEDURE DIVISION.
       BEGIN.

       MOVE 2 TO TMP_VAR.
       PERFORM WITH TEST BEFORE
       VARYING  IND_VAR FROM 1 BY 2 UNTIL IND_VAR >= 9
       ADD 2 TO TMP_VAR 
       END-PERFORM.
       
       DISPLAY "PERFORM05 : " TMP_VAR.
       GOBACK.

