       IDENTIFICATION DIVISION.
       PROGRAM-ID. perform2.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COND_VAR PIC 9(2) USAGE COMP-5.
       01 REPEAT_VAR PIC 9(2) USAGE COMP-5.

       PROCEDURE DIVISION.
       BEGIN.

       MOVE 12 TO REPEAT_VAR.
       MOVE 1 TO COND_VAR 
       PERFORM REPEAT_VAR TIMES 
           ADD 1 TO COND_VAR 
       END-PERFORM.
       
       PERFORM 15 TIMES 
           ADD 1 TO COND_VAR 
       END-PERFORM.
       DISPLAY "PERFORM02 : " COND_VAR

       GOBACK.

