       IDENTIFICATION DIVISION.
       PROGRAM-ID. perform3.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 IND_VAR PIC 9(2) USAGE COMP-5.

       PROCEDURE DIVISION.
       BEGIN.
       MOVE 2 TO IND_VAR.
       PERFORM WITH TEST BEFORE
       UNTIL IND_VAR >= 9
       ADD 2 TO IND_VAR
       END-PERFORM.

       DISPLAY "PERFORM03 : " IND_VAR.
       GOBACK.

