       IDENTIFICATION DIVISION.
       PROGRAM-ID.    MOVE016.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A  PIC S9(8).
       01 B  PIC X(8) REDEFINES A.

       PROCEDURE DIVISION.

       MOVE X"0000000000000030" TO B.
       ADD 1 TO A.
       IF A = 1 DISPLAY "SUCCESS" ELSE DISPLAY "FAIL: " A.

       MOVE X"0000000000000031" TO B.
       ADD 1 TO A.
       IF A = 2 DISPLAY "SUCCESS" ELSE DISPLAY "FAIL: " A.

       MOVE X"0000000000000032" TO B.
       ADD 1 TO A.
       IF A = 3 DISPLAY "SUCCESS" ELSE DISPLAY "FAIL: " A.

       MOVE X"0000000000000033" TO B.
       ADD 1 TO A.
       IF A = 4 DISPLAY "SUCCESS" ELSE DISPLAY "FAIL: " A.

       MOVE X"0000000000000034" TO B.
       ADD 1 TO A.
       IF A = 5 DISPLAY "SUCCESS" ELSE DISPLAY "FAIL: " A
