       IDENTIFICATION DIVISION.
       PROGRAM-ID. set4.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 APTR USAGE POINTER. 
       77 APROC-PTR USAGE PROCEDURE-POINTER.
       LINKAGE SECTION. 
       01 VAR PIC 9999 USAGE COMP-5.

       PROCEDURE DIVISION.
       SET APTR TO ADDRESS OF VAR.
      *   SET APROC-PTR TO ENTRY "set4".  
