       IDENTIFICATION DIVISION.
       PROGRAM-ID. string1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SUBSTR1 PIC X(10).
       01 SUBSTR2 PIC X(10).
       01 SUBSTR3 PIC X(1).
       01 CONCAT  PIC X(20).

       PROCEDURE DIVISION.
       MOVE "ABCD*EFHIJ" TO SUBSTR1.
       MOVE "EFGH*DDFDG" TO SUBSTR2.
       MOVE "*" TO SUBSTR3.
       STRING SUBSTR1 SUBSTR2 DELIMITED SUBSTR3 INTO CONCAT.
       DISPLAY "STRING1:"CONCAT.
