       IDENTIFICATION DIVISION.
       PROGRAM-ID. string2.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SUBSTR1 PIC X(10).
       01 SUBSTR2 PIC X(10).
       01 SUBSTR3 PIC X(10).
       01 CONCAT  PIC X(18).
       01 DELIM   PIC X(1).

       PROCEDURE DIVISION.
       MOVE "abcde*ghij" TO SUBSTR1.
       MOVE "abcde*ghij" TO SUBSTR2.
       MOVE "xxxxx*xxxx" TO SUBSTR3.
       MOVE "*" TO DELIM.
       STRING
         SUBSTR1 SUBSTR2 DELIMITED BY DELIM
         SUBSTR3 DELIMITED BY SIZE
         INTO CONCAT.
       DISPLAY "STRING :"CONCAT.
