       IDENTIFICATION DIVISION.
       PROGRAM-ID. string1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SUBSTR1 PIC X(10).
       01 SUBSTR2 PIC X(10).
       01 CONCAT  PIC X(20).

       PROCEDURE DIVISION.
       MOVE "ABCDxEFHIJ" TO SUBSTR1.
       MOVE "EFGHxIJKLM" TO SUBSTR2.
       STRING SUBSTR1 SUBSTR2 DELIMITED SIZE INTO CONCAT.
       DISPLAY "STRING1:"CONCAT.
