       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBTRACT01.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITEM-01 PIC 9999.
       01 ITEM-02 PIC 9999.
       PROCEDURE DIVISION.
       MOVE 2345 TO ITEM-02.
       SUBTRACT 1234.1 FROM ITEM-02 GIVING ITEM-01 ROUNDED.
       DISPLAY ITEM-01.
