       IDENTIFICATION DIVISION.
       PROGRAM-ID. unstring1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SRC    PIC X(40).
       01 RESULT1 PIC X(10).
       01 RESULT2 PIC X(10).
       01 RESULT3 PIC X(10).
       01 CNT1 PIC 99.
       01 CNT2 PIC 99.
       01 CNT  PIC 9(3).
       01 PTR  PIC 9(3).

       PROCEDURE DIVISION.
       MOVE "XXXXXYYYYY:YYYYXX/XX*UUUUUUUU" TO SRC.
       UNSTRING SRC  INTO RESULT1 RESULT3.

       DISPLAY "UNSTRING : " RESULT1 "  UNSTRING : " RESULT3.
