       IDENTIFICATION DIVISION.
       PROGRAM-ID. unstring1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SRC    PIC X(40).
       01 RESULT1 PIC X(10).
       01 DELIMA PIC X.

       PROCEDURE DIVISION.
       MOVE "XXXXZZXYYYYY:YYYYXX/XX*UUUUUUUU" TO SRC.
       MOVE ":" TO DELIMA.
       UNSTRING SRC  DELIMITED BY DELIMA
       INTO  RESULT1
       ON OVERFLOW DISPLAY "OVER FLOW"
       NOT ON OVERFLOW DISPLAY "NOT OVER FLOW".


