       IDENTIFICATION DIVISION.
       PROGRAM-ID. unstring1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SRC    PIC X(40).
       01 RESULT1 PIC X(10).
       01 RESULT2 PIC X(10).
       01 RESULT3 PIC X(10).
       01 DELIMA PIC X.
       01 DELIMB PIC X.
       01 DELIMC PIC X.
       01 DELIM1 PIC X.
       01 CNT1 PIC 99.
       01 CNT2 PIC 99.
       01 CNT  PIC 9(3).
       01 PTR  PIC 9(3).

       PROCEDURE DIVISION.
       MOVE "XXXXXYYYYY:YYYYXX/XX*UUUUUUUU" TO SRC.
       MOVE ":" TO DELIMA.
       MOVE "/" TO DELIMB.
       MOVE "*" TO DELIMC.
       MOVE "X" TO DELIM1.
       MOVE 1 TO PTR.
       UNSTRING SRC DELIMITED BY DELIMA 
       INTO RESULT1 RESULT2 RESULT3.
      *   COUNT IN CNT1
      *   RESULT2 DELIMITER IN DELIM1 COUNT IN CNT2
      ***   RESULT3.
      *   WITH POINTER PTR
      *   TALLYING IN CNT.

       DISPLAY "UNSTRING:" RESULT1.
       DISPLAY "UNSTRING:" RESULT2.
       DISPLAY "UNSTRING:" RESULT3.

